konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pwm.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : PWM
# Version        : 1
# Bus type       : apb
# Description    : Simple PWM
# =============================================================================
.ifndef	_HARDWARE_REGS_PWM_H
.set	_HARDWARE_REGS_PWM_H, 1
# =============================================================================
# Register    : PWM_CH0_CSR
# Description : Control and status register
.equ	PWM_CH0_CSR_OFFSET, 0x00000000
.equ	PWM_CH0_CSR_BITS, 0x000000ff
.equ	PWM_CH0_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_CSR_PH_ADV
# Description : Advance the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running
#               at less than full speed (div_int + div_frac / 16 > 1)
.equ	PWM_CH0_CSR_PH_ADV_RESET, 0x0
.equ	PWM_CH0_CSR_PH_ADV_BITS, 0x00000080
.equ	PWM_CH0_CSR_PH_ADV_MSB, 7
.equ	PWM_CH0_CSR_PH_ADV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_CSR_PH_RET
# Description : Retard the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running.
.equ	PWM_CH0_CSR_PH_RET_RESET, 0x0
.equ	PWM_CH0_CSR_PH_RET_BITS, 0x00000040
.equ	PWM_CH0_CSR_PH_RET_MSB, 6
.equ	PWM_CH0_CSR_PH_RET_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_CSR_DIVMODE
#               0x0 -> Free-running counting at rate dictated by fractional divider
#               0x1 -> Fractional divider operation is gated by the PWM B pin.
#               0x2 -> Counter advances with each rising edge of the PWM B pin.
#               0x3 -> Counter advances with each falling edge of the PWM B pin.
.equ	PWM_CH0_CSR_DIVMODE_RESET, 0x0
.equ	PWM_CH0_CSR_DIVMODE_BITS, 0x00000030
.equ	PWM_CH0_CSR_DIVMODE_MSB, 5
.equ	PWM_CH0_CSR_DIVMODE_LSB, 4
.equ	PWM_CH0_CSR_DIVMODE_VALUE_DIV, 0x0
.equ	PWM_CH0_CSR_DIVMODE_VALUE_LEVEL, 0x1
.equ	PWM_CH0_CSR_DIVMODE_VALUE_RISE, 0x2
.equ	PWM_CH0_CSR_DIVMODE_VALUE_FALL, 0x3
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_CSR_B_INV
# Description : Invert output B
.equ	PWM_CH0_CSR_B_INV_RESET, 0x0
.equ	PWM_CH0_CSR_B_INV_BITS, 0x00000008
.equ	PWM_CH0_CSR_B_INV_MSB, 3
.equ	PWM_CH0_CSR_B_INV_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_CSR_A_INV
# Description : Invert output A
.equ	PWM_CH0_CSR_A_INV_RESET, 0x0
.equ	PWM_CH0_CSR_A_INV_BITS, 0x00000004
.equ	PWM_CH0_CSR_A_INV_MSB, 2
.equ	PWM_CH0_CSR_A_INV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_CSR_PH_CORRECT
# Description : 1: Enable phase-correct modulation. 0: Trailing-edge
.equ	PWM_CH0_CSR_PH_CORRECT_RESET, 0x0
.equ	PWM_CH0_CSR_PH_CORRECT_BITS, 0x00000002
.equ	PWM_CH0_CSR_PH_CORRECT_MSB, 1
.equ	PWM_CH0_CSR_PH_CORRECT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_CSR_EN
# Description : Enable the PWM channel.
.equ	PWM_CH0_CSR_EN_RESET, 0x0
.equ	PWM_CH0_CSR_EN_BITS, 0x00000001
.equ	PWM_CH0_CSR_EN_MSB, 0
.equ	PWM_CH0_CSR_EN_LSB, 0
# =============================================================================
# Register    : PWM_CH0_DIV
# Description : INT and FRAC form a fixed-point fractional number.
#               Counting rate is system clock frequency divided by this number.
#               Fractional division uses simple 1st-order sigma-delta.
.equ	PWM_CH0_DIV_OFFSET, 0x00000004
.equ	PWM_CH0_DIV_BITS, 0x00000fff
.equ	PWM_CH0_DIV_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_DIV_INT
.equ	PWM_CH0_DIV_INT_RESET, 0x01
.equ	PWM_CH0_DIV_INT_BITS, 0x00000ff0
.equ	PWM_CH0_DIV_INT_MSB, 11
.equ	PWM_CH0_DIV_INT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_DIV_FRAC
.equ	PWM_CH0_DIV_FRAC_RESET, 0x0
.equ	PWM_CH0_DIV_FRAC_BITS, 0x0000000f
.equ	PWM_CH0_DIV_FRAC_MSB, 3
.equ	PWM_CH0_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : PWM_CH0_CTR
# Description : Direct access to the PWM counter
.equ	PWM_CH0_CTR_OFFSET, 0x00000008
.equ	PWM_CH0_CTR_BITS, 0x0000ffff
.equ	PWM_CH0_CTR_RESET, 0x00000000
.equ	PWM_CH0_CTR_MSB, 15
.equ	PWM_CH0_CTR_LSB, 0
# =============================================================================
# Register    : PWM_CH0_CC
# Description : Counter compare values
.equ	PWM_CH0_CC_OFFSET, 0x0000000c
.equ	PWM_CH0_CC_BITS, 0xffffffff
.equ	PWM_CH0_CC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_CC_B
.equ	PWM_CH0_CC_B_RESET, 0x0000
.equ	PWM_CH0_CC_B_BITS, 0xffff0000
.equ	PWM_CH0_CC_B_MSB, 31
.equ	PWM_CH0_CC_B_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PWM_CH0_CC_A
.equ	PWM_CH0_CC_A_RESET, 0x0000
.equ	PWM_CH0_CC_A_BITS, 0x0000ffff
.equ	PWM_CH0_CC_A_MSB, 15
.equ	PWM_CH0_CC_A_LSB, 0
# =============================================================================
# Register    : PWM_CH0_TOP
# Description : Counter wrap value
.equ	PWM_CH0_TOP_OFFSET, 0x00000010
.equ	PWM_CH0_TOP_BITS, 0x0000ffff
.equ	PWM_CH0_TOP_RESET, 0x0000ffff
.equ	PWM_CH0_TOP_MSB, 15
.equ	PWM_CH0_TOP_LSB, 0
# =============================================================================
# Register    : PWM_CH1_CSR
# Description : Control and status register
.equ	PWM_CH1_CSR_OFFSET, 0x00000014
.equ	PWM_CH1_CSR_BITS, 0x000000ff
.equ	PWM_CH1_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_CSR_PH_ADV
# Description : Advance the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running
#               at less than full speed (div_int + div_frac / 16 > 1)
.equ	PWM_CH1_CSR_PH_ADV_RESET, 0x0
.equ	PWM_CH1_CSR_PH_ADV_BITS, 0x00000080
.equ	PWM_CH1_CSR_PH_ADV_MSB, 7
.equ	PWM_CH1_CSR_PH_ADV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_CSR_PH_RET
# Description : Retard the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running.
.equ	PWM_CH1_CSR_PH_RET_RESET, 0x0
.equ	PWM_CH1_CSR_PH_RET_BITS, 0x00000040
.equ	PWM_CH1_CSR_PH_RET_MSB, 6
.equ	PWM_CH1_CSR_PH_RET_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_CSR_DIVMODE
#               0x0 -> Free-running counting at rate dictated by fractional divider
#               0x1 -> Fractional divider operation is gated by the PWM B pin.
#               0x2 -> Counter advances with each rising edge of the PWM B pin.
#               0x3 -> Counter advances with each falling edge of the PWM B pin.
.equ	PWM_CH1_CSR_DIVMODE_RESET, 0x0
.equ	PWM_CH1_CSR_DIVMODE_BITS, 0x00000030
.equ	PWM_CH1_CSR_DIVMODE_MSB, 5
.equ	PWM_CH1_CSR_DIVMODE_LSB, 4
.equ	PWM_CH1_CSR_DIVMODE_VALUE_DIV, 0x0
.equ	PWM_CH1_CSR_DIVMODE_VALUE_LEVEL, 0x1
.equ	PWM_CH1_CSR_DIVMODE_VALUE_RISE, 0x2
.equ	PWM_CH1_CSR_DIVMODE_VALUE_FALL, 0x3
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_CSR_B_INV
# Description : Invert output B
.equ	PWM_CH1_CSR_B_INV_RESET, 0x0
.equ	PWM_CH1_CSR_B_INV_BITS, 0x00000008
.equ	PWM_CH1_CSR_B_INV_MSB, 3
.equ	PWM_CH1_CSR_B_INV_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_CSR_A_INV
# Description : Invert output A
.equ	PWM_CH1_CSR_A_INV_RESET, 0x0
.equ	PWM_CH1_CSR_A_INV_BITS, 0x00000004
.equ	PWM_CH1_CSR_A_INV_MSB, 2
.equ	PWM_CH1_CSR_A_INV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_CSR_PH_CORRECT
# Description : 1: Enable phase-correct modulation. 0: Trailing-edge
.equ	PWM_CH1_CSR_PH_CORRECT_RESET, 0x0
.equ	PWM_CH1_CSR_PH_CORRECT_BITS, 0x00000002
.equ	PWM_CH1_CSR_PH_CORRECT_MSB, 1
.equ	PWM_CH1_CSR_PH_CORRECT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_CSR_EN
# Description : Enable the PWM channel.
.equ	PWM_CH1_CSR_EN_RESET, 0x0
.equ	PWM_CH1_CSR_EN_BITS, 0x00000001
.equ	PWM_CH1_CSR_EN_MSB, 0
.equ	PWM_CH1_CSR_EN_LSB, 0
# =============================================================================
# Register    : PWM_CH1_DIV
# Description : INT and FRAC form a fixed-point fractional number.
#               Counting rate is system clock frequency divided by this number.
#               Fractional division uses simple 1st-order sigma-delta.
.equ	PWM_CH1_DIV_OFFSET, 0x00000018
.equ	PWM_CH1_DIV_BITS, 0x00000fff
.equ	PWM_CH1_DIV_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_DIV_INT
.equ	PWM_CH1_DIV_INT_RESET, 0x01
.equ	PWM_CH1_DIV_INT_BITS, 0x00000ff0
.equ	PWM_CH1_DIV_INT_MSB, 11
.equ	PWM_CH1_DIV_INT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_DIV_FRAC
.equ	PWM_CH1_DIV_FRAC_RESET, 0x0
.equ	PWM_CH1_DIV_FRAC_BITS, 0x0000000f
.equ	PWM_CH1_DIV_FRAC_MSB, 3
.equ	PWM_CH1_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : PWM_CH1_CTR
# Description : Direct access to the PWM counter
.equ	PWM_CH1_CTR_OFFSET, 0x0000001c
.equ	PWM_CH1_CTR_BITS, 0x0000ffff
.equ	PWM_CH1_CTR_RESET, 0x00000000
.equ	PWM_CH1_CTR_MSB, 15
.equ	PWM_CH1_CTR_LSB, 0
# =============================================================================
# Register    : PWM_CH1_CC
# Description : Counter compare values
.equ	PWM_CH1_CC_OFFSET, 0x00000020
.equ	PWM_CH1_CC_BITS, 0xffffffff
.equ	PWM_CH1_CC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_CC_B
.equ	PWM_CH1_CC_B_RESET, 0x0000
.equ	PWM_CH1_CC_B_BITS, 0xffff0000
.equ	PWM_CH1_CC_B_MSB, 31
.equ	PWM_CH1_CC_B_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PWM_CH1_CC_A
.equ	PWM_CH1_CC_A_RESET, 0x0000
.equ	PWM_CH1_CC_A_BITS, 0x0000ffff
.equ	PWM_CH1_CC_A_MSB, 15
.equ	PWM_CH1_CC_A_LSB, 0
# =============================================================================
# Register    : PWM_CH1_TOP
# Description : Counter wrap value
.equ	PWM_CH1_TOP_OFFSET, 0x00000024
.equ	PWM_CH1_TOP_BITS, 0x0000ffff
.equ	PWM_CH1_TOP_RESET, 0x0000ffff
.equ	PWM_CH1_TOP_MSB, 15
.equ	PWM_CH1_TOP_LSB, 0
# =============================================================================
# Register    : PWM_CH2_CSR
# Description : Control and status register
.equ	PWM_CH2_CSR_OFFSET, 0x00000028
.equ	PWM_CH2_CSR_BITS, 0x000000ff
.equ	PWM_CH2_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_CSR_PH_ADV
# Description : Advance the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running
#               at less than full speed (div_int + div_frac / 16 > 1)
.equ	PWM_CH2_CSR_PH_ADV_RESET, 0x0
.equ	PWM_CH2_CSR_PH_ADV_BITS, 0x00000080
.equ	PWM_CH2_CSR_PH_ADV_MSB, 7
.equ	PWM_CH2_CSR_PH_ADV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_CSR_PH_RET
# Description : Retard the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running.
.equ	PWM_CH2_CSR_PH_RET_RESET, 0x0
.equ	PWM_CH2_CSR_PH_RET_BITS, 0x00000040
.equ	PWM_CH2_CSR_PH_RET_MSB, 6
.equ	PWM_CH2_CSR_PH_RET_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_CSR_DIVMODE
#               0x0 -> Free-running counting at rate dictated by fractional divider
#               0x1 -> Fractional divider operation is gated by the PWM B pin.
#               0x2 -> Counter advances with each rising edge of the PWM B pin.
#               0x3 -> Counter advances with each falling edge of the PWM B pin.
.equ	PWM_CH2_CSR_DIVMODE_RESET, 0x0
.equ	PWM_CH2_CSR_DIVMODE_BITS, 0x00000030
.equ	PWM_CH2_CSR_DIVMODE_MSB, 5
.equ	PWM_CH2_CSR_DIVMODE_LSB, 4
.equ	PWM_CH2_CSR_DIVMODE_VALUE_DIV, 0x0
.equ	PWM_CH2_CSR_DIVMODE_VALUE_LEVEL, 0x1
.equ	PWM_CH2_CSR_DIVMODE_VALUE_RISE, 0x2
.equ	PWM_CH2_CSR_DIVMODE_VALUE_FALL, 0x3
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_CSR_B_INV
# Description : Invert output B
.equ	PWM_CH2_CSR_B_INV_RESET, 0x0
.equ	PWM_CH2_CSR_B_INV_BITS, 0x00000008
.equ	PWM_CH2_CSR_B_INV_MSB, 3
.equ	PWM_CH2_CSR_B_INV_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_CSR_A_INV
# Description : Invert output A
.equ	PWM_CH2_CSR_A_INV_RESET, 0x0
.equ	PWM_CH2_CSR_A_INV_BITS, 0x00000004
.equ	PWM_CH2_CSR_A_INV_MSB, 2
.equ	PWM_CH2_CSR_A_INV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_CSR_PH_CORRECT
# Description : 1: Enable phase-correct modulation. 0: Trailing-edge
.equ	PWM_CH2_CSR_PH_CORRECT_RESET, 0x0
.equ	PWM_CH2_CSR_PH_CORRECT_BITS, 0x00000002
.equ	PWM_CH2_CSR_PH_CORRECT_MSB, 1
.equ	PWM_CH2_CSR_PH_CORRECT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_CSR_EN
# Description : Enable the PWM channel.
.equ	PWM_CH2_CSR_EN_RESET, 0x0
.equ	PWM_CH2_CSR_EN_BITS, 0x00000001
.equ	PWM_CH2_CSR_EN_MSB, 0
.equ	PWM_CH2_CSR_EN_LSB, 0
# =============================================================================
# Register    : PWM_CH2_DIV
# Description : INT and FRAC form a fixed-point fractional number.
#               Counting rate is system clock frequency divided by this number.
#               Fractional division uses simple 1st-order sigma-delta.
.equ	PWM_CH2_DIV_OFFSET, 0x0000002c
.equ	PWM_CH2_DIV_BITS, 0x00000fff
.equ	PWM_CH2_DIV_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_DIV_INT
.equ	PWM_CH2_DIV_INT_RESET, 0x01
.equ	PWM_CH2_DIV_INT_BITS, 0x00000ff0
.equ	PWM_CH2_DIV_INT_MSB, 11
.equ	PWM_CH2_DIV_INT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_DIV_FRAC
.equ	PWM_CH2_DIV_FRAC_RESET, 0x0
.equ	PWM_CH2_DIV_FRAC_BITS, 0x0000000f
.equ	PWM_CH2_DIV_FRAC_MSB, 3
.equ	PWM_CH2_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : PWM_CH2_CTR
# Description : Direct access to the PWM counter
.equ	PWM_CH2_CTR_OFFSET, 0x00000030
.equ	PWM_CH2_CTR_BITS, 0x0000ffff
.equ	PWM_CH2_CTR_RESET, 0x00000000
.equ	PWM_CH2_CTR_MSB, 15
.equ	PWM_CH2_CTR_LSB, 0
# =============================================================================
# Register    : PWM_CH2_CC
# Description : Counter compare values
.equ	PWM_CH2_CC_OFFSET, 0x00000034
.equ	PWM_CH2_CC_BITS, 0xffffffff
.equ	PWM_CH2_CC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_CC_B
.equ	PWM_CH2_CC_B_RESET, 0x0000
.equ	PWM_CH2_CC_B_BITS, 0xffff0000
.equ	PWM_CH2_CC_B_MSB, 31
.equ	PWM_CH2_CC_B_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PWM_CH2_CC_A
.equ	PWM_CH2_CC_A_RESET, 0x0000
.equ	PWM_CH2_CC_A_BITS, 0x0000ffff
.equ	PWM_CH2_CC_A_MSB, 15
.equ	PWM_CH2_CC_A_LSB, 0
# =============================================================================
# Register    : PWM_CH2_TOP
# Description : Counter wrap value
.equ	PWM_CH2_TOP_OFFSET, 0x00000038
.equ	PWM_CH2_TOP_BITS, 0x0000ffff
.equ	PWM_CH2_TOP_RESET, 0x0000ffff
.equ	PWM_CH2_TOP_MSB, 15
.equ	PWM_CH2_TOP_LSB, 0
# =============================================================================
# Register    : PWM_CH3_CSR
# Description : Control and status register
.equ	PWM_CH3_CSR_OFFSET, 0x0000003c
.equ	PWM_CH3_CSR_BITS, 0x000000ff
.equ	PWM_CH3_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_CSR_PH_ADV
# Description : Advance the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running
#               at less than full speed (div_int + div_frac / 16 > 1)
.equ	PWM_CH3_CSR_PH_ADV_RESET, 0x0
.equ	PWM_CH3_CSR_PH_ADV_BITS, 0x00000080
.equ	PWM_CH3_CSR_PH_ADV_MSB, 7
.equ	PWM_CH3_CSR_PH_ADV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_CSR_PH_RET
# Description : Retard the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running.
.equ	PWM_CH3_CSR_PH_RET_RESET, 0x0
.equ	PWM_CH3_CSR_PH_RET_BITS, 0x00000040
.equ	PWM_CH3_CSR_PH_RET_MSB, 6
.equ	PWM_CH3_CSR_PH_RET_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_CSR_DIVMODE
#               0x0 -> Free-running counting at rate dictated by fractional divider
#               0x1 -> Fractional divider operation is gated by the PWM B pin.
#               0x2 -> Counter advances with each rising edge of the PWM B pin.
#               0x3 -> Counter advances with each falling edge of the PWM B pin.
.equ	PWM_CH3_CSR_DIVMODE_RESET, 0x0
.equ	PWM_CH3_CSR_DIVMODE_BITS, 0x00000030
.equ	PWM_CH3_CSR_DIVMODE_MSB, 5
.equ	PWM_CH3_CSR_DIVMODE_LSB, 4
.equ	PWM_CH3_CSR_DIVMODE_VALUE_DIV, 0x0
.equ	PWM_CH3_CSR_DIVMODE_VALUE_LEVEL, 0x1
.equ	PWM_CH3_CSR_DIVMODE_VALUE_RISE, 0x2
.equ	PWM_CH3_CSR_DIVMODE_VALUE_FALL, 0x3
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_CSR_B_INV
# Description : Invert output B
.equ	PWM_CH3_CSR_B_INV_RESET, 0x0
.equ	PWM_CH3_CSR_B_INV_BITS, 0x00000008
.equ	PWM_CH3_CSR_B_INV_MSB, 3
.equ	PWM_CH3_CSR_B_INV_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_CSR_A_INV
# Description : Invert output A
.equ	PWM_CH3_CSR_A_INV_RESET, 0x0
.equ	PWM_CH3_CSR_A_INV_BITS, 0x00000004
.equ	PWM_CH3_CSR_A_INV_MSB, 2
.equ	PWM_CH3_CSR_A_INV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_CSR_PH_CORRECT
# Description : 1: Enable phase-correct modulation. 0: Trailing-edge
.equ	PWM_CH3_CSR_PH_CORRECT_RESET, 0x0
.equ	PWM_CH3_CSR_PH_CORRECT_BITS, 0x00000002
.equ	PWM_CH3_CSR_PH_CORRECT_MSB, 1
.equ	PWM_CH3_CSR_PH_CORRECT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_CSR_EN
# Description : Enable the PWM channel.
.equ	PWM_CH3_CSR_EN_RESET, 0x0
.equ	PWM_CH3_CSR_EN_BITS, 0x00000001
.equ	PWM_CH3_CSR_EN_MSB, 0
.equ	PWM_CH3_CSR_EN_LSB, 0
# =============================================================================
# Register    : PWM_CH3_DIV
# Description : INT and FRAC form a fixed-point fractional number.
#               Counting rate is system clock frequency divided by this number.
#               Fractional division uses simple 1st-order sigma-delta.
.equ	PWM_CH3_DIV_OFFSET, 0x00000040
.equ	PWM_CH3_DIV_BITS, 0x00000fff
.equ	PWM_CH3_DIV_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_DIV_INT
.equ	PWM_CH3_DIV_INT_RESET, 0x01
.equ	PWM_CH3_DIV_INT_BITS, 0x00000ff0
.equ	PWM_CH3_DIV_INT_MSB, 11
.equ	PWM_CH3_DIV_INT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_DIV_FRAC
.equ	PWM_CH3_DIV_FRAC_RESET, 0x0
.equ	PWM_CH3_DIV_FRAC_BITS, 0x0000000f
.equ	PWM_CH3_DIV_FRAC_MSB, 3
.equ	PWM_CH3_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : PWM_CH3_CTR
# Description : Direct access to the PWM counter
.equ	PWM_CH3_CTR_OFFSET, 0x00000044
.equ	PWM_CH3_CTR_BITS, 0x0000ffff
.equ	PWM_CH3_CTR_RESET, 0x00000000
.equ	PWM_CH3_CTR_MSB, 15
.equ	PWM_CH3_CTR_LSB, 0
# =============================================================================
# Register    : PWM_CH3_CC
# Description : Counter compare values
.equ	PWM_CH3_CC_OFFSET, 0x00000048
.equ	PWM_CH3_CC_BITS, 0xffffffff
.equ	PWM_CH3_CC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_CC_B
.equ	PWM_CH3_CC_B_RESET, 0x0000
.equ	PWM_CH3_CC_B_BITS, 0xffff0000
.equ	PWM_CH3_CC_B_MSB, 31
.equ	PWM_CH3_CC_B_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PWM_CH3_CC_A
.equ	PWM_CH3_CC_A_RESET, 0x0000
.equ	PWM_CH3_CC_A_BITS, 0x0000ffff
.equ	PWM_CH3_CC_A_MSB, 15
.equ	PWM_CH3_CC_A_LSB, 0
# =============================================================================
# Register    : PWM_CH3_TOP
# Description : Counter wrap value
.equ	PWM_CH3_TOP_OFFSET, 0x0000004c
.equ	PWM_CH3_TOP_BITS, 0x0000ffff
.equ	PWM_CH3_TOP_RESET, 0x0000ffff
.equ	PWM_CH3_TOP_MSB, 15
.equ	PWM_CH3_TOP_LSB, 0
# =============================================================================
# Register    : PWM_CH4_CSR
# Description : Control and status register
.equ	PWM_CH4_CSR_OFFSET, 0x00000050
.equ	PWM_CH4_CSR_BITS, 0x000000ff
.equ	PWM_CH4_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_CSR_PH_ADV
# Description : Advance the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running
#               at less than full speed (div_int + div_frac / 16 > 1)
.equ	PWM_CH4_CSR_PH_ADV_RESET, 0x0
.equ	PWM_CH4_CSR_PH_ADV_BITS, 0x00000080
.equ	PWM_CH4_CSR_PH_ADV_MSB, 7
.equ	PWM_CH4_CSR_PH_ADV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_CSR_PH_RET
# Description : Retard the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running.
.equ	PWM_CH4_CSR_PH_RET_RESET, 0x0
.equ	PWM_CH4_CSR_PH_RET_BITS, 0x00000040
.equ	PWM_CH4_CSR_PH_RET_MSB, 6
.equ	PWM_CH4_CSR_PH_RET_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_CSR_DIVMODE
#               0x0 -> Free-running counting at rate dictated by fractional divider
#               0x1 -> Fractional divider operation is gated by the PWM B pin.
#               0x2 -> Counter advances with each rising edge of the PWM B pin.
#               0x3 -> Counter advances with each falling edge of the PWM B pin.
.equ	PWM_CH4_CSR_DIVMODE_RESET, 0x0
.equ	PWM_CH4_CSR_DIVMODE_BITS, 0x00000030
.equ	PWM_CH4_CSR_DIVMODE_MSB, 5
.equ	PWM_CH4_CSR_DIVMODE_LSB, 4
.equ	PWM_CH4_CSR_DIVMODE_VALUE_DIV, 0x0
.equ	PWM_CH4_CSR_DIVMODE_VALUE_LEVEL, 0x1
.equ	PWM_CH4_CSR_DIVMODE_VALUE_RISE, 0x2
