konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pwm.inc
.equ	PWM_CH4_CSR_DIVMODE_VALUE_FALL, 0x3
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_CSR_B_INV
# Description : Invert output B
.equ	PWM_CH4_CSR_B_INV_RESET, 0x0
.equ	PWM_CH4_CSR_B_INV_BITS, 0x00000008
.equ	PWM_CH4_CSR_B_INV_MSB, 3
.equ	PWM_CH4_CSR_B_INV_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_CSR_A_INV
# Description : Invert output A
.equ	PWM_CH4_CSR_A_INV_RESET, 0x0
.equ	PWM_CH4_CSR_A_INV_BITS, 0x00000004
.equ	PWM_CH4_CSR_A_INV_MSB, 2
.equ	PWM_CH4_CSR_A_INV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_CSR_PH_CORRECT
# Description : 1: Enable phase-correct modulation. 0: Trailing-edge
.equ	PWM_CH4_CSR_PH_CORRECT_RESET, 0x0
.equ	PWM_CH4_CSR_PH_CORRECT_BITS, 0x00000002
.equ	PWM_CH4_CSR_PH_CORRECT_MSB, 1
.equ	PWM_CH4_CSR_PH_CORRECT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_CSR_EN
# Description : Enable the PWM channel.
.equ	PWM_CH4_CSR_EN_RESET, 0x0
.equ	PWM_CH4_CSR_EN_BITS, 0x00000001
.equ	PWM_CH4_CSR_EN_MSB, 0
.equ	PWM_CH4_CSR_EN_LSB, 0
# =============================================================================
# Register    : PWM_CH4_DIV
# Description : INT and FRAC form a fixed-point fractional number.
#               Counting rate is system clock frequency divided by this number.
#               Fractional division uses simple 1st-order sigma-delta.
.equ	PWM_CH4_DIV_OFFSET, 0x00000054
.equ	PWM_CH4_DIV_BITS, 0x00000fff
.equ	PWM_CH4_DIV_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_DIV_INT
.equ	PWM_CH4_DIV_INT_RESET, 0x01
.equ	PWM_CH4_DIV_INT_BITS, 0x00000ff0
.equ	PWM_CH4_DIV_INT_MSB, 11
.equ	PWM_CH4_DIV_INT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_DIV_FRAC
.equ	PWM_CH4_DIV_FRAC_RESET, 0x0
.equ	PWM_CH4_DIV_FRAC_BITS, 0x0000000f
.equ	PWM_CH4_DIV_FRAC_MSB, 3
.equ	PWM_CH4_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : PWM_CH4_CTR
# Description : Direct access to the PWM counter
.equ	PWM_CH4_CTR_OFFSET, 0x00000058
.equ	PWM_CH4_CTR_BITS, 0x0000ffff
.equ	PWM_CH4_CTR_RESET, 0x00000000
.equ	PWM_CH4_CTR_MSB, 15
.equ	PWM_CH4_CTR_LSB, 0
# =============================================================================
# Register    : PWM_CH4_CC
# Description : Counter compare values
.equ	PWM_CH4_CC_OFFSET, 0x0000005c
.equ	PWM_CH4_CC_BITS, 0xffffffff
.equ	PWM_CH4_CC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_CC_B
.equ	PWM_CH4_CC_B_RESET, 0x0000
.equ	PWM_CH4_CC_B_BITS, 0xffff0000
.equ	PWM_CH4_CC_B_MSB, 31
.equ	PWM_CH4_CC_B_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PWM_CH4_CC_A
.equ	PWM_CH4_CC_A_RESET, 0x0000
.equ	PWM_CH4_CC_A_BITS, 0x0000ffff
.equ	PWM_CH4_CC_A_MSB, 15
.equ	PWM_CH4_CC_A_LSB, 0
# =============================================================================
# Register    : PWM_CH4_TOP
# Description : Counter wrap value
.equ	PWM_CH4_TOP_OFFSET, 0x00000060
.equ	PWM_CH4_TOP_BITS, 0x0000ffff
.equ	PWM_CH4_TOP_RESET, 0x0000ffff
.equ	PWM_CH4_TOP_MSB, 15
.equ	PWM_CH4_TOP_LSB, 0
# =============================================================================
# Register    : PWM_CH5_CSR
# Description : Control and status register
.equ	PWM_CH5_CSR_OFFSET, 0x00000064
.equ	PWM_CH5_CSR_BITS, 0x000000ff
.equ	PWM_CH5_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_CSR_PH_ADV
# Description : Advance the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running
#               at less than full speed (div_int + div_frac / 16 > 1)
.equ	PWM_CH5_CSR_PH_ADV_RESET, 0x0
.equ	PWM_CH5_CSR_PH_ADV_BITS, 0x00000080
.equ	PWM_CH5_CSR_PH_ADV_MSB, 7
.equ	PWM_CH5_CSR_PH_ADV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_CSR_PH_RET
# Description : Retard the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running.
.equ	PWM_CH5_CSR_PH_RET_RESET, 0x0
.equ	PWM_CH5_CSR_PH_RET_BITS, 0x00000040
.equ	PWM_CH5_CSR_PH_RET_MSB, 6
.equ	PWM_CH5_CSR_PH_RET_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_CSR_DIVMODE
#               0x0 -> Free-running counting at rate dictated by fractional divider
#               0x1 -> Fractional divider operation is gated by the PWM B pin.
#               0x2 -> Counter advances with each rising edge of the PWM B pin.
#               0x3 -> Counter advances with each falling edge of the PWM B pin.
.equ	PWM_CH5_CSR_DIVMODE_RESET, 0x0
.equ	PWM_CH5_CSR_DIVMODE_BITS, 0x00000030
.equ	PWM_CH5_CSR_DIVMODE_MSB, 5
.equ	PWM_CH5_CSR_DIVMODE_LSB, 4
.equ	PWM_CH5_CSR_DIVMODE_VALUE_DIV, 0x0
.equ	PWM_CH5_CSR_DIVMODE_VALUE_LEVEL, 0x1
.equ	PWM_CH5_CSR_DIVMODE_VALUE_RISE, 0x2
.equ	PWM_CH5_CSR_DIVMODE_VALUE_FALL, 0x3
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_CSR_B_INV
# Description : Invert output B
.equ	PWM_CH5_CSR_B_INV_RESET, 0x0
.equ	PWM_CH5_CSR_B_INV_BITS, 0x00000008
.equ	PWM_CH5_CSR_B_INV_MSB, 3
.equ	PWM_CH5_CSR_B_INV_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_CSR_A_INV
# Description : Invert output A
.equ	PWM_CH5_CSR_A_INV_RESET, 0x0
.equ	PWM_CH5_CSR_A_INV_BITS, 0x00000004
.equ	PWM_CH5_CSR_A_INV_MSB, 2
.equ	PWM_CH5_CSR_A_INV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_CSR_PH_CORRECT
# Description : 1: Enable phase-correct modulation. 0: Trailing-edge
.equ	PWM_CH5_CSR_PH_CORRECT_RESET, 0x0
.equ	PWM_CH5_CSR_PH_CORRECT_BITS, 0x00000002
.equ	PWM_CH5_CSR_PH_CORRECT_MSB, 1
.equ	PWM_CH5_CSR_PH_CORRECT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_CSR_EN
# Description : Enable the PWM channel.
.equ	PWM_CH5_CSR_EN_RESET, 0x0
.equ	PWM_CH5_CSR_EN_BITS, 0x00000001
.equ	PWM_CH5_CSR_EN_MSB, 0
.equ	PWM_CH5_CSR_EN_LSB, 0
# =============================================================================
# Register    : PWM_CH5_DIV
# Description : INT and FRAC form a fixed-point fractional number.
#               Counting rate is system clock frequency divided by this number.
#               Fractional division uses simple 1st-order sigma-delta.
.equ	PWM_CH5_DIV_OFFSET, 0x00000068
.equ	PWM_CH5_DIV_BITS, 0x00000fff
.equ	PWM_CH5_DIV_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_DIV_INT
.equ	PWM_CH5_DIV_INT_RESET, 0x01
.equ	PWM_CH5_DIV_INT_BITS, 0x00000ff0
.equ	PWM_CH5_DIV_INT_MSB, 11
.equ	PWM_CH5_DIV_INT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_DIV_FRAC
.equ	PWM_CH5_DIV_FRAC_RESET, 0x0
.equ	PWM_CH5_DIV_FRAC_BITS, 0x0000000f
.equ	PWM_CH5_DIV_FRAC_MSB, 3
.equ	PWM_CH5_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : PWM_CH5_CTR
# Description : Direct access to the PWM counter
.equ	PWM_CH5_CTR_OFFSET, 0x0000006c
.equ	PWM_CH5_CTR_BITS, 0x0000ffff
.equ	PWM_CH5_CTR_RESET, 0x00000000
.equ	PWM_CH5_CTR_MSB, 15
.equ	PWM_CH5_CTR_LSB, 0
# =============================================================================
# Register    : PWM_CH5_CC
# Description : Counter compare values
.equ	PWM_CH5_CC_OFFSET, 0x00000070
.equ	PWM_CH5_CC_BITS, 0xffffffff
.equ	PWM_CH5_CC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_CC_B
.equ	PWM_CH5_CC_B_RESET, 0x0000
.equ	PWM_CH5_CC_B_BITS, 0xffff0000
.equ	PWM_CH5_CC_B_MSB, 31
.equ	PWM_CH5_CC_B_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PWM_CH5_CC_A
.equ	PWM_CH5_CC_A_RESET, 0x0000
.equ	PWM_CH5_CC_A_BITS, 0x0000ffff
.equ	PWM_CH5_CC_A_MSB, 15
.equ	PWM_CH5_CC_A_LSB, 0
# =============================================================================
# Register    : PWM_CH5_TOP
# Description : Counter wrap value
.equ	PWM_CH5_TOP_OFFSET, 0x00000074
.equ	PWM_CH5_TOP_BITS, 0x0000ffff
.equ	PWM_CH5_TOP_RESET, 0x0000ffff
.equ	PWM_CH5_TOP_MSB, 15
.equ	PWM_CH5_TOP_LSB, 0
# =============================================================================
# Register    : PWM_CH6_CSR
# Description : Control and status register
.equ	PWM_CH6_CSR_OFFSET, 0x00000078
.equ	PWM_CH6_CSR_BITS, 0x000000ff
.equ	PWM_CH6_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_CSR_PH_ADV
# Description : Advance the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running
#               at less than full speed (div_int + div_frac / 16 > 1)
.equ	PWM_CH6_CSR_PH_ADV_RESET, 0x0
.equ	PWM_CH6_CSR_PH_ADV_BITS, 0x00000080
.equ	PWM_CH6_CSR_PH_ADV_MSB, 7
.equ	PWM_CH6_CSR_PH_ADV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_CSR_PH_RET
# Description : Retard the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running.
.equ	PWM_CH6_CSR_PH_RET_RESET, 0x0
.equ	PWM_CH6_CSR_PH_RET_BITS, 0x00000040
.equ	PWM_CH6_CSR_PH_RET_MSB, 6
.equ	PWM_CH6_CSR_PH_RET_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_CSR_DIVMODE
#               0x0 -> Free-running counting at rate dictated by fractional divider
#               0x1 -> Fractional divider operation is gated by the PWM B pin.
#               0x2 -> Counter advances with each rising edge of the PWM B pin.
#               0x3 -> Counter advances with each falling edge of the PWM B pin.
.equ	PWM_CH6_CSR_DIVMODE_RESET, 0x0
.equ	PWM_CH6_CSR_DIVMODE_BITS, 0x00000030
.equ	PWM_CH6_CSR_DIVMODE_MSB, 5
.equ	PWM_CH6_CSR_DIVMODE_LSB, 4
.equ	PWM_CH6_CSR_DIVMODE_VALUE_DIV, 0x0
.equ	PWM_CH6_CSR_DIVMODE_VALUE_LEVEL, 0x1
.equ	PWM_CH6_CSR_DIVMODE_VALUE_RISE, 0x2
.equ	PWM_CH6_CSR_DIVMODE_VALUE_FALL, 0x3
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_CSR_B_INV
# Description : Invert output B
.equ	PWM_CH6_CSR_B_INV_RESET, 0x0
.equ	PWM_CH6_CSR_B_INV_BITS, 0x00000008
.equ	PWM_CH6_CSR_B_INV_MSB, 3
.equ	PWM_CH6_CSR_B_INV_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_CSR_A_INV
# Description : Invert output A
.equ	PWM_CH6_CSR_A_INV_RESET, 0x0
.equ	PWM_CH6_CSR_A_INV_BITS, 0x00000004
.equ	PWM_CH6_CSR_A_INV_MSB, 2
.equ	PWM_CH6_CSR_A_INV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_CSR_PH_CORRECT
# Description : 1: Enable phase-correct modulation. 0: Trailing-edge
.equ	PWM_CH6_CSR_PH_CORRECT_RESET, 0x0
.equ	PWM_CH6_CSR_PH_CORRECT_BITS, 0x00000002
.equ	PWM_CH6_CSR_PH_CORRECT_MSB, 1
.equ	PWM_CH6_CSR_PH_CORRECT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_CSR_EN
# Description : Enable the PWM channel.
.equ	PWM_CH6_CSR_EN_RESET, 0x0
.equ	PWM_CH6_CSR_EN_BITS, 0x00000001
.equ	PWM_CH6_CSR_EN_MSB, 0
.equ	PWM_CH6_CSR_EN_LSB, 0
# =============================================================================
# Register    : PWM_CH6_DIV
# Description : INT and FRAC form a fixed-point fractional number.
#               Counting rate is system clock frequency divided by this number.
#               Fractional division uses simple 1st-order sigma-delta.
.equ	PWM_CH6_DIV_OFFSET, 0x0000007c
.equ	PWM_CH6_DIV_BITS, 0x00000fff
.equ	PWM_CH6_DIV_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_DIV_INT
.equ	PWM_CH6_DIV_INT_RESET, 0x01
.equ	PWM_CH6_DIV_INT_BITS, 0x00000ff0
.equ	PWM_CH6_DIV_INT_MSB, 11
.equ	PWM_CH6_DIV_INT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_DIV_FRAC
.equ	PWM_CH6_DIV_FRAC_RESET, 0x0
.equ	PWM_CH6_DIV_FRAC_BITS, 0x0000000f
.equ	PWM_CH6_DIV_FRAC_MSB, 3
.equ	PWM_CH6_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : PWM_CH6_CTR
# Description : Direct access to the PWM counter
.equ	PWM_CH6_CTR_OFFSET, 0x00000080
.equ	PWM_CH6_CTR_BITS, 0x0000ffff
.equ	PWM_CH6_CTR_RESET, 0x00000000
.equ	PWM_CH6_CTR_MSB, 15
.equ	PWM_CH6_CTR_LSB, 0
# =============================================================================
# Register    : PWM_CH6_CC
# Description : Counter compare values
.equ	PWM_CH6_CC_OFFSET, 0x00000084
.equ	PWM_CH6_CC_BITS, 0xffffffff
.equ	PWM_CH6_CC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_CC_B
.equ	PWM_CH6_CC_B_RESET, 0x0000
.equ	PWM_CH6_CC_B_BITS, 0xffff0000
.equ	PWM_CH6_CC_B_MSB, 31
.equ	PWM_CH6_CC_B_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PWM_CH6_CC_A
.equ	PWM_CH6_CC_A_RESET, 0x0000
.equ	PWM_CH6_CC_A_BITS, 0x0000ffff
.equ	PWM_CH6_CC_A_MSB, 15
.equ	PWM_CH6_CC_A_LSB, 0
# =============================================================================
# Register    : PWM_CH6_TOP
# Description : Counter wrap value
.equ	PWM_CH6_TOP_OFFSET, 0x00000088
.equ	PWM_CH6_TOP_BITS, 0x0000ffff
.equ	PWM_CH6_TOP_RESET, 0x0000ffff
.equ	PWM_CH6_TOP_MSB, 15
.equ	PWM_CH6_TOP_LSB, 0
# =============================================================================
# Register    : PWM_CH7_CSR
# Description : Control and status register
.equ	PWM_CH7_CSR_OFFSET, 0x0000008c
.equ	PWM_CH7_CSR_BITS, 0x000000ff
.equ	PWM_CH7_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_CSR_PH_ADV
# Description : Advance the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running
#               at less than full speed (div_int + div_frac / 16 > 1)
.equ	PWM_CH7_CSR_PH_ADV_RESET, 0x0
.equ	PWM_CH7_CSR_PH_ADV_BITS, 0x00000080
.equ	PWM_CH7_CSR_PH_ADV_MSB, 7
.equ	PWM_CH7_CSR_PH_ADV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_CSR_PH_RET
# Description : Retard the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running.
.equ	PWM_CH7_CSR_PH_RET_RESET, 0x0
.equ	PWM_CH7_CSR_PH_RET_BITS, 0x00000040
.equ	PWM_CH7_CSR_PH_RET_MSB, 6
.equ	PWM_CH7_CSR_PH_RET_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_CSR_DIVMODE
#               0x0 -> Free-running counting at rate dictated by fractional divider
#               0x1 -> Fractional divider operation is gated by the PWM B pin.
#               0x2 -> Counter advances with each rising edge of the PWM B pin.
#               0x3 -> Counter advances with each falling edge of the PWM B pin.
.equ	PWM_CH7_CSR_DIVMODE_RESET, 0x0
.equ	PWM_CH7_CSR_DIVMODE_BITS, 0x00000030
.equ	PWM_CH7_CSR_DIVMODE_MSB, 5
.equ	PWM_CH7_CSR_DIVMODE_LSB, 4
.equ	PWM_CH7_CSR_DIVMODE_VALUE_DIV, 0x0
.equ	PWM_CH7_CSR_DIVMODE_VALUE_LEVEL, 0x1
.equ	PWM_CH7_CSR_DIVMODE_VALUE_RISE, 0x2
.equ	PWM_CH7_CSR_DIVMODE_VALUE_FALL, 0x3
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_CSR_B_INV
# Description : Invert output B
.equ	PWM_CH7_CSR_B_INV_RESET, 0x0
.equ	PWM_CH7_CSR_B_INV_BITS, 0x00000008
.equ	PWM_CH7_CSR_B_INV_MSB, 3
.equ	PWM_CH7_CSR_B_INV_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_CSR_A_INV
# Description : Invert output A
.equ	PWM_CH7_CSR_A_INV_RESET, 0x0
.equ	PWM_CH7_CSR_A_INV_BITS, 0x00000004
.equ	PWM_CH7_CSR_A_INV_MSB, 2
.equ	PWM_CH7_CSR_A_INV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_CSR_PH_CORRECT
# Description : 1: Enable phase-correct modulation. 0: Trailing-edge
.equ	PWM_CH7_CSR_PH_CORRECT_RESET, 0x0
.equ	PWM_CH7_CSR_PH_CORRECT_BITS, 0x00000002
.equ	PWM_CH7_CSR_PH_CORRECT_MSB, 1
.equ	PWM_CH7_CSR_PH_CORRECT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_CSR_EN
# Description : Enable the PWM channel.
.equ	PWM_CH7_CSR_EN_RESET, 0x0
.equ	PWM_CH7_CSR_EN_BITS, 0x00000001
.equ	PWM_CH7_CSR_EN_MSB, 0
.equ	PWM_CH7_CSR_EN_LSB, 0
# =============================================================================
# Register    : PWM_CH7_DIV
# Description : INT and FRAC form a fixed-point fractional number.
#               Counting rate is system clock frequency divided by this number.
#               Fractional division uses simple 1st-order sigma-delta.
.equ	PWM_CH7_DIV_OFFSET, 0x00000090
.equ	PWM_CH7_DIV_BITS, 0x00000fff
.equ	PWM_CH7_DIV_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_DIV_INT
.equ	PWM_CH7_DIV_INT_RESET, 0x01
.equ	PWM_CH7_DIV_INT_BITS, 0x00000ff0
.equ	PWM_CH7_DIV_INT_MSB, 11
.equ	PWM_CH7_DIV_INT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_DIV_FRAC
.equ	PWM_CH7_DIV_FRAC_RESET, 0x0
.equ	PWM_CH7_DIV_FRAC_BITS, 0x0000000f
.equ	PWM_CH7_DIV_FRAC_MSB, 3
.equ	PWM_CH7_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : PWM_CH7_CTR
# Description : Direct access to the PWM counter
.equ	PWM_CH7_CTR_OFFSET, 0x00000094
.equ	PWM_CH7_CTR_BITS, 0x0000ffff
.equ	PWM_CH7_CTR_RESET, 0x00000000
.equ	PWM_CH7_CTR_MSB, 15
.equ	PWM_CH7_CTR_LSB, 0
# =============================================================================
# Register    : PWM_CH7_CC
# Description : Counter compare values
.equ	PWM_CH7_CC_OFFSET, 0x00000098
.equ	PWM_CH7_CC_BITS, 0xffffffff
.equ	PWM_CH7_CC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_CC_B
.equ	PWM_CH7_CC_B_RESET, 0x0000
.equ	PWM_CH7_CC_B_BITS, 0xffff0000
.equ	PWM_CH7_CC_B_MSB, 31
.equ	PWM_CH7_CC_B_LSB, 16
# -----------------------------------------------------------------------------
# Field       : PWM_CH7_CC_A
.equ	PWM_CH7_CC_A_RESET, 0x0000
.equ	PWM_CH7_CC_A_BITS, 0x0000ffff
.equ	PWM_CH7_CC_A_MSB, 15
.equ	PWM_CH7_CC_A_LSB, 0
# =============================================================================
# Register    : PWM_CH7_TOP
# Description : Counter wrap value
.equ	PWM_CH7_TOP_OFFSET, 0x0000009c
.equ	PWM_CH7_TOP_BITS, 0x0000ffff
.equ	PWM_CH7_TOP_RESET, 0x0000ffff
.equ	PWM_CH7_TOP_MSB, 15
.equ	PWM_CH7_TOP_LSB, 0
# =============================================================================
# Register    : PWM_CH8_CSR
# Description : Control and status register
.equ	PWM_CH8_CSR_OFFSET, 0x000000a0
.equ	PWM_CH8_CSR_BITS, 0x000000ff
.equ	PWM_CH8_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_CH8_CSR_PH_ADV
# Description : Advance the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running
#               at less than full speed (div_int + div_frac / 16 > 1)
.equ	PWM_CH8_CSR_PH_ADV_RESET, 0x0
.equ	PWM_CH8_CSR_PH_ADV_BITS, 0x00000080
.equ	PWM_CH8_CSR_PH_ADV_MSB, 7
.equ	PWM_CH8_CSR_PH_ADV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_CH8_CSR_PH_RET
# Description : Retard the phase of the counter by 1 count, while it is
#               running.
#               Self-clearing. Write a 1, and poll until low. Counter must be
#               running.
.equ	PWM_CH8_CSR_PH_RET_RESET, 0x0
.equ	PWM_CH8_CSR_PH_RET_BITS, 0x00000040
.equ	PWM_CH8_CSR_PH_RET_MSB, 6
.equ	PWM_CH8_CSR_PH_RET_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_CH8_CSR_DIVMODE
#               0x0 -> Free-running counting at rate dictated by fractional divider
#               0x1 -> Fractional divider operation is gated by the PWM B pin.
#               0x2 -> Counter advances with each rising edge of the PWM B pin.
#               0x3 -> Counter advances with each falling edge of the PWM B pin.
.equ	PWM_CH8_CSR_DIVMODE_RESET, 0x0
.equ	PWM_CH8_CSR_DIVMODE_BITS, 0x00000030
.equ	PWM_CH8_CSR_DIVMODE_MSB, 5
.equ	PWM_CH8_CSR_DIVMODE_LSB, 4
.equ	PWM_CH8_CSR_DIVMODE_VALUE_DIV, 0x0
.equ	PWM_CH8_CSR_DIVMODE_VALUE_LEVEL, 0x1
.equ	PWM_CH8_CSR_DIVMODE_VALUE_RISE, 0x2
.equ	PWM_CH8_CSR_DIVMODE_VALUE_FALL, 0x3
# -----------------------------------------------------------------------------
# Field       : PWM_CH8_CSR_B_INV
# Description : Invert output B
.equ	PWM_CH8_CSR_B_INV_RESET, 0x0
.equ	PWM_CH8_CSR_B_INV_BITS, 0x00000008
.equ	PWM_CH8_CSR_B_INV_MSB, 3
.equ	PWM_CH8_CSR_B_INV_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_CH8_CSR_A_INV
# Description : Invert output A
.equ	PWM_CH8_CSR_A_INV_RESET, 0x0
.equ	PWM_CH8_CSR_A_INV_BITS, 0x00000004
.equ	PWM_CH8_CSR_A_INV_MSB, 2
.equ	PWM_CH8_CSR_A_INV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_CH8_CSR_PH_CORRECT
# Description : 1: Enable phase-correct modulation. 0: Trailing-edge
.equ	PWM_CH8_CSR_PH_CORRECT_RESET, 0x0
.equ	PWM_CH8_CSR_PH_CORRECT_BITS, 0x00000002
.equ	PWM_CH8_CSR_PH_CORRECT_MSB, 1
.equ	PWM_CH8_CSR_PH_CORRECT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_CH8_CSR_EN
# Description : Enable the PWM channel.
.equ	PWM_CH8_CSR_EN_RESET, 0x0
.equ	PWM_CH8_CSR_EN_BITS, 0x00000001
.equ	PWM_CH8_CSR_EN_MSB, 0
.equ	PWM_CH8_CSR_EN_LSB, 0
# =============================================================================
# Register    : PWM_CH8_DIV
# Description : INT and FRAC form a fixed-point fractional number.
#               Counting rate is system clock frequency divided by this number.
#               Fractional division uses simple 1st-order sigma-delta.
.equ	PWM_CH8_DIV_OFFSET, 0x000000a4
.equ	PWM_CH8_DIV_BITS, 0x00000fff
.equ	PWM_CH8_DIV_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : PWM_CH8_DIV_INT
.equ	PWM_CH8_DIV_INT_RESET, 0x01
.equ	PWM_CH8_DIV_INT_BITS, 0x00000ff0
.equ	PWM_CH8_DIV_INT_MSB, 11
.equ	PWM_CH8_DIV_INT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_CH8_DIV_FRAC
.equ	PWM_CH8_DIV_FRAC_RESET, 0x0
.equ	PWM_CH8_DIV_FRAC_BITS, 0x0000000f
.equ	PWM_CH8_DIV_FRAC_MSB, 3
.equ	PWM_CH8_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : PWM_CH8_CTR
# Description : Direct access to the PWM counter
.equ	PWM_CH8_CTR_OFFSET, 0x000000a8
.equ	PWM_CH8_CTR_BITS, 0x0000ffff
.equ	PWM_CH8_CTR_RESET, 0x00000000
.equ	PWM_CH8_CTR_MSB, 15
.equ	PWM_CH8_CTR_LSB, 0
