konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pwm.inc
.equ	PWM_IRQ0_INTE_CH10_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH10_BITS, 0x00000400
.equ	PWM_IRQ0_INTE_CH10_MSB, 10
.equ	PWM_IRQ0_INTE_CH10_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH9
.equ	PWM_IRQ0_INTE_CH9_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH9_BITS, 0x00000200
.equ	PWM_IRQ0_INTE_CH9_MSB, 9
.equ	PWM_IRQ0_INTE_CH9_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH8
.equ	PWM_IRQ0_INTE_CH8_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH8_BITS, 0x00000100
.equ	PWM_IRQ0_INTE_CH8_MSB, 8
.equ	PWM_IRQ0_INTE_CH8_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH7
.equ	PWM_IRQ0_INTE_CH7_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH7_BITS, 0x00000080
.equ	PWM_IRQ0_INTE_CH7_MSB, 7
.equ	PWM_IRQ0_INTE_CH7_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH6
.equ	PWM_IRQ0_INTE_CH6_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH6_BITS, 0x00000040
.equ	PWM_IRQ0_INTE_CH6_MSB, 6
.equ	PWM_IRQ0_INTE_CH6_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH5
.equ	PWM_IRQ0_INTE_CH5_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH5_BITS, 0x00000020
.equ	PWM_IRQ0_INTE_CH5_MSB, 5
.equ	PWM_IRQ0_INTE_CH5_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH4
.equ	PWM_IRQ0_INTE_CH4_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH4_BITS, 0x00000010
.equ	PWM_IRQ0_INTE_CH4_MSB, 4
.equ	PWM_IRQ0_INTE_CH4_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH3
.equ	PWM_IRQ0_INTE_CH3_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH3_BITS, 0x00000008
.equ	PWM_IRQ0_INTE_CH3_MSB, 3
.equ	PWM_IRQ0_INTE_CH3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH2
.equ	PWM_IRQ0_INTE_CH2_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH2_BITS, 0x00000004
.equ	PWM_IRQ0_INTE_CH2_MSB, 2
.equ	PWM_IRQ0_INTE_CH2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH1
.equ	PWM_IRQ0_INTE_CH1_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH1_BITS, 0x00000002
.equ	PWM_IRQ0_INTE_CH1_MSB, 1
.equ	PWM_IRQ0_INTE_CH1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTE_CH0
.equ	PWM_IRQ0_INTE_CH0_RESET, 0x0
.equ	PWM_IRQ0_INTE_CH0_BITS, 0x00000001
.equ	PWM_IRQ0_INTE_CH0_MSB, 0
.equ	PWM_IRQ0_INTE_CH0_LSB, 0
# =============================================================================
# Register    : PWM_IRQ0_INTF
# Description : Interrupt Force for irq0
.equ	PWM_IRQ0_INTF_OFFSET, 0x000000fc
.equ	PWM_IRQ0_INTF_BITS, 0x00000fff
.equ	PWM_IRQ0_INTF_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH11
.equ	PWM_IRQ0_INTF_CH11_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH11_BITS, 0x00000800
.equ	PWM_IRQ0_INTF_CH11_MSB, 11
.equ	PWM_IRQ0_INTF_CH11_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH10
.equ	PWM_IRQ0_INTF_CH10_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH10_BITS, 0x00000400
.equ	PWM_IRQ0_INTF_CH10_MSB, 10
.equ	PWM_IRQ0_INTF_CH10_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH9
.equ	PWM_IRQ0_INTF_CH9_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH9_BITS, 0x00000200
.equ	PWM_IRQ0_INTF_CH9_MSB, 9
.equ	PWM_IRQ0_INTF_CH9_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH8
.equ	PWM_IRQ0_INTF_CH8_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH8_BITS, 0x00000100
.equ	PWM_IRQ0_INTF_CH8_MSB, 8
.equ	PWM_IRQ0_INTF_CH8_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH7
.equ	PWM_IRQ0_INTF_CH7_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH7_BITS, 0x00000080
.equ	PWM_IRQ0_INTF_CH7_MSB, 7
.equ	PWM_IRQ0_INTF_CH7_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH6
.equ	PWM_IRQ0_INTF_CH6_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH6_BITS, 0x00000040
.equ	PWM_IRQ0_INTF_CH6_MSB, 6
.equ	PWM_IRQ0_INTF_CH6_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH5
.equ	PWM_IRQ0_INTF_CH5_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH5_BITS, 0x00000020
.equ	PWM_IRQ0_INTF_CH5_MSB, 5
.equ	PWM_IRQ0_INTF_CH5_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH4
.equ	PWM_IRQ0_INTF_CH4_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH4_BITS, 0x00000010
.equ	PWM_IRQ0_INTF_CH4_MSB, 4
.equ	PWM_IRQ0_INTF_CH4_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH3
.equ	PWM_IRQ0_INTF_CH3_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH3_BITS, 0x00000008
.equ	PWM_IRQ0_INTF_CH3_MSB, 3
.equ	PWM_IRQ0_INTF_CH3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH2
.equ	PWM_IRQ0_INTF_CH2_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH2_BITS, 0x00000004
.equ	PWM_IRQ0_INTF_CH2_MSB, 2
.equ	PWM_IRQ0_INTF_CH2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH1
.equ	PWM_IRQ0_INTF_CH1_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH1_BITS, 0x00000002
.equ	PWM_IRQ0_INTF_CH1_MSB, 1
.equ	PWM_IRQ0_INTF_CH1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTF_CH0
.equ	PWM_IRQ0_INTF_CH0_RESET, 0x0
.equ	PWM_IRQ0_INTF_CH0_BITS, 0x00000001
.equ	PWM_IRQ0_INTF_CH0_MSB, 0
.equ	PWM_IRQ0_INTF_CH0_LSB, 0
# =============================================================================
# Register    : PWM_IRQ0_INTS
# Description : Interrupt status after masking & forcing for irq0
.equ	PWM_IRQ0_INTS_OFFSET, 0x00000100
.equ	PWM_IRQ0_INTS_BITS, 0x00000fff
.equ	PWM_IRQ0_INTS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH11
.equ	PWM_IRQ0_INTS_CH11_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH11_BITS, 0x00000800
.equ	PWM_IRQ0_INTS_CH11_MSB, 11
.equ	PWM_IRQ0_INTS_CH11_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH10
.equ	PWM_IRQ0_INTS_CH10_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH10_BITS, 0x00000400
.equ	PWM_IRQ0_INTS_CH10_MSB, 10
.equ	PWM_IRQ0_INTS_CH10_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH9
.equ	PWM_IRQ0_INTS_CH9_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH9_BITS, 0x00000200
.equ	PWM_IRQ0_INTS_CH9_MSB, 9
.equ	PWM_IRQ0_INTS_CH9_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH8
.equ	PWM_IRQ0_INTS_CH8_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH8_BITS, 0x00000100
.equ	PWM_IRQ0_INTS_CH8_MSB, 8
.equ	PWM_IRQ0_INTS_CH8_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH7
.equ	PWM_IRQ0_INTS_CH7_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH7_BITS, 0x00000080
.equ	PWM_IRQ0_INTS_CH7_MSB, 7
.equ	PWM_IRQ0_INTS_CH7_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH6
.equ	PWM_IRQ0_INTS_CH6_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH6_BITS, 0x00000040
.equ	PWM_IRQ0_INTS_CH6_MSB, 6
.equ	PWM_IRQ0_INTS_CH6_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH5
.equ	PWM_IRQ0_INTS_CH5_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH5_BITS, 0x00000020
.equ	PWM_IRQ0_INTS_CH5_MSB, 5
.equ	PWM_IRQ0_INTS_CH5_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH4
.equ	PWM_IRQ0_INTS_CH4_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH4_BITS, 0x00000010
.equ	PWM_IRQ0_INTS_CH4_MSB, 4
.equ	PWM_IRQ0_INTS_CH4_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH3
.equ	PWM_IRQ0_INTS_CH3_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH3_BITS, 0x00000008
.equ	PWM_IRQ0_INTS_CH3_MSB, 3
.equ	PWM_IRQ0_INTS_CH3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH2
.equ	PWM_IRQ0_INTS_CH2_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH2_BITS, 0x00000004
.equ	PWM_IRQ0_INTS_CH2_MSB, 2
.equ	PWM_IRQ0_INTS_CH2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH1
.equ	PWM_IRQ0_INTS_CH1_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH1_BITS, 0x00000002
.equ	PWM_IRQ0_INTS_CH1_MSB, 1
.equ	PWM_IRQ0_INTS_CH1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ0_INTS_CH0
.equ	PWM_IRQ0_INTS_CH0_RESET, 0x0
.equ	PWM_IRQ0_INTS_CH0_BITS, 0x00000001
.equ	PWM_IRQ0_INTS_CH0_MSB, 0
.equ	PWM_IRQ0_INTS_CH0_LSB, 0
# =============================================================================
# Register    : PWM_IRQ1_INTE
# Description : Interrupt Enable for irq1
.equ	PWM_IRQ1_INTE_OFFSET, 0x00000104
.equ	PWM_IRQ1_INTE_BITS, 0x00000fff
.equ	PWM_IRQ1_INTE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH11
.equ	PWM_IRQ1_INTE_CH11_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH11_BITS, 0x00000800
.equ	PWM_IRQ1_INTE_CH11_MSB, 11
.equ	PWM_IRQ1_INTE_CH11_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH10
.equ	PWM_IRQ1_INTE_CH10_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH10_BITS, 0x00000400
.equ	PWM_IRQ1_INTE_CH10_MSB, 10
.equ	PWM_IRQ1_INTE_CH10_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH9
.equ	PWM_IRQ1_INTE_CH9_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH9_BITS, 0x00000200
.equ	PWM_IRQ1_INTE_CH9_MSB, 9
.equ	PWM_IRQ1_INTE_CH9_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH8
.equ	PWM_IRQ1_INTE_CH8_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH8_BITS, 0x00000100
.equ	PWM_IRQ1_INTE_CH8_MSB, 8
.equ	PWM_IRQ1_INTE_CH8_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH7
.equ	PWM_IRQ1_INTE_CH7_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH7_BITS, 0x00000080
.equ	PWM_IRQ1_INTE_CH7_MSB, 7
.equ	PWM_IRQ1_INTE_CH7_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH6
.equ	PWM_IRQ1_INTE_CH6_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH6_BITS, 0x00000040
.equ	PWM_IRQ1_INTE_CH6_MSB, 6
.equ	PWM_IRQ1_INTE_CH6_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH5
.equ	PWM_IRQ1_INTE_CH5_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH5_BITS, 0x00000020
.equ	PWM_IRQ1_INTE_CH5_MSB, 5
.equ	PWM_IRQ1_INTE_CH5_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH4
.equ	PWM_IRQ1_INTE_CH4_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH4_BITS, 0x00000010
.equ	PWM_IRQ1_INTE_CH4_MSB, 4
.equ	PWM_IRQ1_INTE_CH4_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH3
.equ	PWM_IRQ1_INTE_CH3_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH3_BITS, 0x00000008
.equ	PWM_IRQ1_INTE_CH3_MSB, 3
.equ	PWM_IRQ1_INTE_CH3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH2
.equ	PWM_IRQ1_INTE_CH2_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH2_BITS, 0x00000004
.equ	PWM_IRQ1_INTE_CH2_MSB, 2
.equ	PWM_IRQ1_INTE_CH2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH1
.equ	PWM_IRQ1_INTE_CH1_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH1_BITS, 0x00000002
.equ	PWM_IRQ1_INTE_CH1_MSB, 1
.equ	PWM_IRQ1_INTE_CH1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTE_CH0
.equ	PWM_IRQ1_INTE_CH0_RESET, 0x0
.equ	PWM_IRQ1_INTE_CH0_BITS, 0x00000001
.equ	PWM_IRQ1_INTE_CH0_MSB, 0
.equ	PWM_IRQ1_INTE_CH0_LSB, 0
# =============================================================================
# Register    : PWM_IRQ1_INTF
# Description : Interrupt Force for irq1
.equ	PWM_IRQ1_INTF_OFFSET, 0x00000108
.equ	PWM_IRQ1_INTF_BITS, 0x00000fff
.equ	PWM_IRQ1_INTF_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH11
.equ	PWM_IRQ1_INTF_CH11_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH11_BITS, 0x00000800
.equ	PWM_IRQ1_INTF_CH11_MSB, 11
.equ	PWM_IRQ1_INTF_CH11_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH10
.equ	PWM_IRQ1_INTF_CH10_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH10_BITS, 0x00000400
.equ	PWM_IRQ1_INTF_CH10_MSB, 10
.equ	PWM_IRQ1_INTF_CH10_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH9
.equ	PWM_IRQ1_INTF_CH9_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH9_BITS, 0x00000200
.equ	PWM_IRQ1_INTF_CH9_MSB, 9
.equ	PWM_IRQ1_INTF_CH9_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH8
.equ	PWM_IRQ1_INTF_CH8_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH8_BITS, 0x00000100
.equ	PWM_IRQ1_INTF_CH8_MSB, 8
.equ	PWM_IRQ1_INTF_CH8_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH7
.equ	PWM_IRQ1_INTF_CH7_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH7_BITS, 0x00000080
.equ	PWM_IRQ1_INTF_CH7_MSB, 7
.equ	PWM_IRQ1_INTF_CH7_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH6
.equ	PWM_IRQ1_INTF_CH6_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH6_BITS, 0x00000040
.equ	PWM_IRQ1_INTF_CH6_MSB, 6
.equ	PWM_IRQ1_INTF_CH6_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH5
.equ	PWM_IRQ1_INTF_CH5_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH5_BITS, 0x00000020
.equ	PWM_IRQ1_INTF_CH5_MSB, 5
.equ	PWM_IRQ1_INTF_CH5_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH4
.equ	PWM_IRQ1_INTF_CH4_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH4_BITS, 0x00000010
.equ	PWM_IRQ1_INTF_CH4_MSB, 4
.equ	PWM_IRQ1_INTF_CH4_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH3
.equ	PWM_IRQ1_INTF_CH3_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH3_BITS, 0x00000008
.equ	PWM_IRQ1_INTF_CH3_MSB, 3
.equ	PWM_IRQ1_INTF_CH3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH2
.equ	PWM_IRQ1_INTF_CH2_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH2_BITS, 0x00000004
.equ	PWM_IRQ1_INTF_CH2_MSB, 2
.equ	PWM_IRQ1_INTF_CH2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH1
.equ	PWM_IRQ1_INTF_CH1_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH1_BITS, 0x00000002
.equ	PWM_IRQ1_INTF_CH1_MSB, 1
.equ	PWM_IRQ1_INTF_CH1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTF_CH0
.equ	PWM_IRQ1_INTF_CH0_RESET, 0x0
.equ	PWM_IRQ1_INTF_CH0_BITS, 0x00000001
.equ	PWM_IRQ1_INTF_CH0_MSB, 0
.equ	PWM_IRQ1_INTF_CH0_LSB, 0
# =============================================================================
# Register    : PWM_IRQ1_INTS
# Description : Interrupt status after masking & forcing for irq1
.equ	PWM_IRQ1_INTS_OFFSET, 0x0000010c
.equ	PWM_IRQ1_INTS_BITS, 0x00000fff
.equ	PWM_IRQ1_INTS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH11
.equ	PWM_IRQ1_INTS_CH11_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH11_BITS, 0x00000800
.equ	PWM_IRQ1_INTS_CH11_MSB, 11
.equ	PWM_IRQ1_INTS_CH11_LSB, 11
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH10
.equ	PWM_IRQ1_INTS_CH10_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH10_BITS, 0x00000400
.equ	PWM_IRQ1_INTS_CH10_MSB, 10
.equ	PWM_IRQ1_INTS_CH10_LSB, 10
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH9
.equ	PWM_IRQ1_INTS_CH9_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH9_BITS, 0x00000200
.equ	PWM_IRQ1_INTS_CH9_MSB, 9
.equ	PWM_IRQ1_INTS_CH9_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH8
.equ	PWM_IRQ1_INTS_CH8_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH8_BITS, 0x00000100
.equ	PWM_IRQ1_INTS_CH8_MSB, 8
.equ	PWM_IRQ1_INTS_CH8_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH7
.equ	PWM_IRQ1_INTS_CH7_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH7_BITS, 0x00000080
.equ	PWM_IRQ1_INTS_CH7_MSB, 7
.equ	PWM_IRQ1_INTS_CH7_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH6
.equ	PWM_IRQ1_INTS_CH6_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH6_BITS, 0x00000040
.equ	PWM_IRQ1_INTS_CH6_MSB, 6
.equ	PWM_IRQ1_INTS_CH6_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH5
.equ	PWM_IRQ1_INTS_CH5_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH5_BITS, 0x00000020
.equ	PWM_IRQ1_INTS_CH5_MSB, 5
.equ	PWM_IRQ1_INTS_CH5_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH4
.equ	PWM_IRQ1_INTS_CH4_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH4_BITS, 0x00000010
.equ	PWM_IRQ1_INTS_CH4_MSB, 4
.equ	PWM_IRQ1_INTS_CH4_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH3
.equ	PWM_IRQ1_INTS_CH3_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH3_BITS, 0x00000008
.equ	PWM_IRQ1_INTS_CH3_MSB, 3
.equ	PWM_IRQ1_INTS_CH3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH2
.equ	PWM_IRQ1_INTS_CH2_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH2_BITS, 0x00000004
.equ	PWM_IRQ1_INTS_CH2_MSB, 2
.equ	PWM_IRQ1_INTS_CH2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH1
.equ	PWM_IRQ1_INTS_CH1_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH1_BITS, 0x00000002
.equ	PWM_IRQ1_INTS_CH1_MSB, 1
.equ	PWM_IRQ1_INTS_CH1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PWM_IRQ1_INTS_CH0
.equ	PWM_IRQ1_INTS_CH0_RESET, 0x0
.equ	PWM_IRQ1_INTS_CH0_BITS, 0x00000001
.equ	PWM_IRQ1_INTS_CH0_MSB, 0
.equ	PWM_IRQ1_INTS_CH0_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_PWM_H
